In [1]:
import numpy as np
from pandas import Series,DataFrame
import pandas as pd

In [2]:
ser = Series(np.arange(3), index = ['A','B','C'])

In [3]:
ser

A    0
B    1
C    2
dtype: int32

In [5]:
ser.drop('B')

A    0
C    2
dtype: int32

In [8]:
df = DataFrame(np.arange(9).reshape((3,3)),index=['SF','LA','NY'],columns=['pop','size','year'])

In [9]:
df

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [11]:
df.drop('LA')

    pop  size  year
SF    0     1     2
NY    6     7     8

In [15]:
df.drop('year',axis=1)

    pop  size
SF    0     1
LA    3     4
NY    6     7